# Laboratorio No. 2 - Data Science

Manuel Rodas - 21509 / Sebastián Solorzano - 21826

In [1]:
import pandas as pd

### Carga de datos

In [24]:
consumo_df = pd.read_csv('consumo.csv', sep=';', encoding='utf-8')
consumo_df = consumo_df.dropna(axis=1, how='all')
consumo_df = consumo_df[['Fecha', 'Gasolina regular', 'Gasolina superior', 'Diesel bajo azufre', 'Gas licuado de petr�leo']]
consumo_df.head()

,Fecha,Gasolina regular,Gasolina superior,Diesel bajo azufre,Gas licuado de petr�leo
0,ene/2000,"202 645,20","308 156,82","0,00","194 410,48"
1,feb/2000,"205 530,96","307 766,31","0,00","174 710,55"
2,mar/2000,"229 499,56","331 910,29","0,00","189 234,07"
3,abr/2000,"210 680,40","315 648,08","0,00","174 330,61"
4,may/2000,"208 164,34","319 667,97","0,00","191 745,15"

In [25]:
importacion_df = pd.read_csv('importacion.csv', sep=';', encoding='utf-8')
importacion_df = importacion_df.dropna(axis=1, how='all')
importacion_df = importacion_df[['Fecha', 'Gasolina regular', 'Gasolina superior', 'Diesel bajo azufre', 'Gas licuado de petr�leo']]
importacion_df.head()

,Fecha,Gasolina regular,Gasolina superior,Diesel bajo azufre,Gas licuado de petr�leo
0,ene/2001,"177 776,50","373 963,96","0,00","194 065,74"
1,feb/2001,"123 115,99","243 091,07","0,00","170 703,38"
2,mar/2001,"161 726,42","312 084,38","0,00","161 837,37"
3,abr/2001,"127 338,74","285 054,89","0,00","163 048,64"
4,may/2001,"168 730,19","300 913,67","0,00","171 518,86"

In [26]:
precios2024_df = pd.read_csv('precios2024.csv', sep=';', encoding='utf-8')
precios2024_df = precios2024_df.dropna(axis=1, how='all')

precios2023_df = pd.read_csv('precios2023.csv', sep=';', encoding='utf-8')
precios2023_df = precios2023_df.dropna(axis=1, how='all')

precios2022_df = pd.read_csv('precios2022.csv', sep=';', encoding='utf-8')
precios2022_df = precios2022_df.dropna(axis=1, how='all')

precios2021_df = pd.read_csv('precios2021.csv', sep=';', encoding='utf-8')
precios2021_df = precios2021_df.dropna(axis=1, how='all')

precios_df = pd.concat([precios2021_df, precios2022_df, precios2023_df, precios2024_df])
precios_df = precios_df[['FECHA', 'Superior', 'Regular', 'Diesel', 'Glp Cilindro 25Lbs.']]
precios_df.columns = ['Fecha', 'Gasolina superior', 'Gasolina regular', 'Diesel', 'Gas licuado de petróleo']
precios_df.head()

,Fecha,Gasolina superior,Gasolina regular,Diesel,Gas licuado de petróleo
0,01/ene/2021,"21,91","21,11","17,61","99,00"
1,02/ene/2021,"21,91","21,11","17,61","99,00"
2,03/ene/2021,"21,91","21,11","17,61","99,00"
3,04/ene/2021,"21,91","21,11","17,61","99,00"
4,05/ene/2021,"21,91","21,11","17,61","99,00"